; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l25_p25_c25_g25)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    loc11 - location
    loc12 - location
    loc13 - location
    loc14 - location
    loc15 - location
    loc16 - location
    loc17 - location
    loc18 - location
    loc19 - location
    loc20 - location
    loc21 - location
    loc22 - location
    loc23 - location
    loc24 - location
    loc25 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    person11 - person
    person12 - person
    person13 - person
    person14 - person
    person15 - person
    person16 - person
    person17 - person
    person18 - person
    person19 - person
    person20 - person
    person21 - person
    person22 - person
    person23 - person
    person24 - person
    person25 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    crate11 - crate
    crate12 - crate
    crate13 - crate
    crate14 - crate
    crate15 - crate
    crate16 - crate
    crate17 - crate
    crate18 - crate
    crate19 - crate
    crate20 - crate
    crate21 - crate
    crate22 - crate
    crate23 - crate
    crate24 - crate
    crate25 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-crate crate11 depot)
    (at-crate crate12 depot)
    (at-crate crate13 depot)
    (at-crate crate14 depot)
    (at-crate crate15 depot)
    (at-crate crate16 depot)
    (at-crate crate17 depot)
    (at-crate crate18 depot)
    (at-crate crate19 depot)
    (at-crate crate20 depot)
    (at-crate crate21 depot)
    (at-crate crate22 depot)
    (at-crate crate23 depot)
    (at-crate crate24 depot)
    (at-crate crate25 depot)
    (at-person person1 loc12)
    (at-person person2 loc4)
    (at-person person3 loc6)
    (at-person person4 loc1)
    (at-person person5 loc13)
    (at-person person6 loc16)
    (at-person person7 loc15)
    (at-person person8 loc12)
    (at-person person9 loc6)
    (at-person person10 loc18)
    (at-person person11 loc12)
    (at-person person12 loc18)
    (at-person person13 loc8)
    (at-person person14 loc15)
    (at-person person15 loc21)
    (at-person person16 loc18)
    (at-person person17 loc15)
    (at-person person18 loc7)
    (at-person person19 loc11)
    (at-person person20 loc6)
    (at-person person21 loc18)
    (at-person person22 loc16)
    (at-person person23 loc12)
    (at-person person24 loc3)
    (at-person person25 loc21)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 food)
    (crate-content crate7 food)
    (crate-content crate8 food)
    (crate-content crate9 food)
    (crate-content crate10 food)
    (crate-content crate11 food)
    (crate-content crate12 food)
    (crate-content crate13 food)
    (crate-content crate14 food)
    (crate-content crate15 food)
    (crate-content crate16 food)
    (crate-content crate17 food)
    (crate-content crate18 food)
    (crate-content crate19 food)
    (crate-content crate20 food)
    (crate-content crate21 food)
    (crate-content crate22 food)
    (crate-content crate23 medicine)
    (crate-content crate24 medicine)
    (crate-content crate25 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person2 food)
    (has-content person3 food)
    (has-content person3 medicine)
    (has-content person4 food)
    (has-content person5 food)
    (has-content person5 medicine)
    (has-content person6 food)
    (has-content person8 food)
    (has-content person9 food)
    (has-content person10 food)
    (has-content person12 food)
    (has-content person13 food)
    (has-content person14 food)
    (has-content person15 food)
    (has-content person15 medicine)
    (has-content person16 food)
    (has-content person18 food)
    (has-content person19 food)
    (has-content person20 food)
    (has-content person21 food)
    (has-content person22 food)
    (has-content person23 food)
    (has-content person24 food)
    (has-content person25 food)
  ))
)

; plan
1. (pick-up drone1 right crate23 depot)
   deleted: (at-crate crate23 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate23)
   goals met: 0 of 25
2. (pick-up drone1 left crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate1)
   goals met: 0 of 25
3. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 0 of 25
4. (deliver drone1 left crate1 person2 loc4 food)
   deleted: (holding drone1 left crate1)
   added: (hand-empty drone1 left) (has-content person2 food)
   goals met: 1 of 25
5. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 1 of 25
6. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 1 of 25
7. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 1 of 25
8. (deliver drone1 left crate2 person4 loc1 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person4 food)
   goals met: 2 of 25
9. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 2 of 25
10. (pick-up drone1 left crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate3)
   goals met: 2 of 25
11. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 2 of 25
12. (fly drone1 loc13 loc8)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc8)
   goals met: 2 of 25
13. (deliver drone1 left crate3 person13 loc8 food)
   deleted: (holding drone1 left crate3)
   added: (hand-empty drone1 left) (has-content person13 food)
   goals met: 3 of 25
14. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 3 of 25
15. (pick-up drone1 left crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate4)
   goals met: 3 of 25
16. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 3 of 25
17. (fly drone1 loc13 loc15)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc15)
   goals met: 3 of 25
18. (deliver drone1 left crate4 person14 loc15 food)
   deleted: (holding drone1 left crate4)
   added: (hand-empty drone1 left) (has-content person14 food)
   goals met: 4 of 25
19. (fly drone1 loc15 depot)
   deleted: (at-drone drone1 loc15)
   added: (at-drone drone1 depot)
   goals met: 4 of 25
20. (pick-up drone1 left crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate5)
   goals met: 4 of 25
21. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 4 of 25
22. (fly drone1 loc13 loc7)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc7)
   goals met: 4 of 25
23. (deliver drone1 left crate5 person18 loc7 food)
   deleted: (holding drone1 left crate5)
   added: (hand-empty drone1 left) (has-content person18 food)
   goals met: 5 of 25
24. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 5 of 25
25. (pick-up drone1 left crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate6)
   goals met: 5 of 25
26. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 5 of 25
27. (fly drone1 loc13 loc11)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc11)
   goals met: 5 of 25
28. (deliver drone1 left crate6 person19 loc11 food)
   deleted: (holding drone1 left crate6)
   added: (hand-empty drone1 left) (has-content person19 food)
   goals met: 6 of 25
29. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 6 of 25
30. (pick-up drone1 left crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate7)
   goals met: 6 of 25
31. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 6 of 25
32. (fly drone1 loc13 loc3)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc3)
   goals met: 6 of 25
33. (deliver drone1 left crate7 person24 loc3 food)
   deleted: (holding drone1 left crate7)
   added: (hand-empty drone1 left) (has-content person24 food)
   goals met: 7 of 25
34. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 7 of 25
35. (pick-up drone1 left crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate8)
   goals met: 7 of 25
36. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 7 of 25
37. (deliver drone1 left crate8 person5 loc13 food)
   deleted: (holding drone1 left crate8)
   added: (hand-empty drone1 left) (has-content person5 food)
   goals met: 8 of 25
38. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 8 of 25
39. (pick-up drone1 left crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate9)
   goals met: 8 of 25
40. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 8 of 25
41. (deliver drone1 right crate23 person5 loc13 medicine)
   deleted: (holding drone1 right crate23)
   added: (hand-empty drone1 right) (has-content person5 medicine)
   goals met: 9 of 25
42. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 9 of 25
43. (pick-up drone1 right crate24 depot)
   deleted: (at-crate crate24 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate24)
   goals met: 9 of 25
44. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 9 of 25
45. (deliver drone1 left crate9 person3 loc6 food)
   deleted: (holding drone1 left crate9)
   added: (hand-empty drone1 left) (has-content person3 food)
   goals met: 10 of 25
46. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 10 of 25
47. (pick-up drone1 left crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate10)
   goals met: 10 of 25
48. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 10 of 25
49. (deliver drone1 right crate24 person3 loc6 medicine)
   deleted: (holding drone1 right crate24)
   added: (hand-empty drone1 right) (has-content person3 medicine)
   goals met: 11 of 25
50. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 11 of 25
51. (pick-up drone1 right crate25 depot)
   deleted: (at-crate crate25 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate25)
   goals met: 11 of 25
52. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 11 of 25
53. (fly drone1 loc6 loc21)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 loc21)
   goals met: 11 of 25
54. (deliver drone1 right crate25 person15 loc21 medicine)
   deleted: (holding drone1 right crate25)
   added: (hand-empty drone1 right) (has-content person15 medicine)
   goals met: 12 of 25
55. (deliver drone1 left crate10 person15 loc21 food)
   deleted: (holding drone1 left crate10)
   added: (hand-empty drone1 left) (has-content person15 food)
   goals met: 13 of 25
56. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 13 of 25
57. (pick-up drone1 right crate11 depot)
   deleted: (at-crate crate11 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate11)
   goals met: 13 of 25
58. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 13 of 25
59. (fly drone1 loc6 loc21)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 loc21)
   goals met: 13 of 25
60. (deliver drone1 right crate11 person25 loc21 food)
   deleted: (holding drone1 right crate11)
   added: (hand-empty drone1 right) (has-content person25 food)
   goals met: 14 of 25
61. (fly drone1 loc21 depot)
   deleted: (at-drone drone1 loc21)
   added: (at-drone drone1 depot)
   goals met: 14 of 25
62. (pick-up drone1 right crate12 depot)
   deleted: (at-crate crate12 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate12)
   goals met: 14 of 25
63. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 14 of 25
64. (deliver drone1 right crate12 person9 loc6 food)
   deleted: (holding drone1 right crate12)
   added: (hand-empty drone1 right) (has-content person9 food)
   goals met: 15 of 25
65. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 15 of 25
66. (pick-up drone1 right crate13 depot)
   deleted: (at-crate crate13 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate13)
   goals met: 15 of 25
67. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 15 of 25
68. (deliver drone1 right crate13 person20 loc6 food)
   deleted: (holding drone1 right crate13)
   added: (hand-empty drone1 right) (has-content person20 food)
   goals met: 16 of 25
69. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 16 of 25
70. (pick-up drone1 right crate14 depot)
   deleted: (at-crate crate14 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate14)
   goals met: 16 of 25
71. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 16 of 25
72. (deliver drone1 right crate14 person10 loc18 food)
   deleted: (holding drone1 right crate14)
   added: (hand-empty drone1 right) (has-content person10 food)
   goals met: 17 of 25
73. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 17 of 25
74. (pick-up drone1 right crate15 depot)
   deleted: (at-crate crate15 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate15)
   goals met: 17 of 25
75. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 17 of 25
76. (deliver drone1 right crate15 person12 loc18 food)
   deleted: (holding drone1 right crate15)
   added: (hand-empty drone1 right) (has-content person12 food)
   goals met: 18 of 25
77. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 18 of 25
78. (pick-up drone1 right crate16 depot)
   deleted: (at-crate crate16 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate16)
   goals met: 18 of 25
79. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 18 of 25
80. (deliver drone1 right crate16 person16 loc18 food)
   deleted: (holding drone1 right crate16)
   added: (hand-empty drone1 right) (has-content person16 food)
   goals met: 19 of 25
81. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 19 of 25
82. (pick-up drone1 right crate17 depot)
   deleted: (at-crate crate17 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate17)
   goals met: 19 of 25
83. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 19 of 25
84. (deliver drone1 right crate17 person21 loc18 food)
   deleted: (holding drone1 right crate17)
   added: (hand-empty drone1 right) (has-content person21 food)
   goals met: 20 of 25
85. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 20 of 25
86. (pick-up drone1 right crate18 depot)
   deleted: (at-crate crate18 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate18)
   goals met: 20 of 25
87. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 20 of 25
88. (deliver drone1 right crate18 person6 loc16 food)
   deleted: (holding drone1 right crate18)
   added: (hand-empty drone1 right) (has-content person6 food)
   goals met: 21 of 25
89. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 21 of 25
90. (pick-up drone1 right crate19 depot)
   deleted: (at-crate crate19 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate19)
   goals met: 21 of 25
91. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 21 of 25
92. (deliver drone1 right crate19 person22 loc16 food)
   deleted: (holding drone1 right crate19)
   added: (hand-empty drone1 right) (has-content person22 food)
   goals met: 22 of 25
93. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 22 of 25
94. (pick-up drone1 right crate20 depot)
   deleted: (at-crate crate20 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate20)
   goals met: 22 of 25
95. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 22 of 25
96. (deliver drone1 right crate20 person1 loc12 food)
   deleted: (holding drone1 right crate20)
   added: (hand-empty drone1 right) (has-content person1 food)
   goals met: 23 of 25
97. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 23 of 25
98. (pick-up drone1 right crate21 depot)
   deleted: (at-crate crate21 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate21)
   goals met: 23 of 25
99. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 23 of 25
100. (deliver drone1 right crate21 person8 loc12 food)
   deleted: (holding drone1 right crate21)
   added: (hand-empty drone1 right) (has-content person8 food)
   goals met: 24 of 25
101. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 24 of 25
102. (pick-up drone1 right crate22 depot)
   deleted: (at-crate crate22 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate22)
   goals met: 24 of 25
103. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 24 of 25
104. (deliver drone1 right crate22 person23 loc12 food)
   deleted: (holding drone1 right crate22)
   added: (hand-empty drone1 right) (has-content person23 food)
   goals met: 25 of 25
